playwright-artillery.yml
config:
  target: http://3.35.19.209:3000/

  phases:
    - name: "Warm up"
      duration: 10
      arrivalRate: 1
      rampTo: 5
    - name: "Peak load"
      duration: 20
      arrivalRate: 5
      rampTo: 10
    - name: "Scale down"
      duration: 10
      arrivalRate: 10
      rampTo: 1

  engines:
    playwright:
      launchOptions:
        headless: true
    
  processor: "./stresstest/app.js"

scenarios:
  - engine: playwright
    testFunction: "createNewChat"