playwright-artillery.yml
config:
  target: http://13.124.37.26:3000/

  phases:
  - name: "Single user test"
    duration: 30
    arrivalRate: 1
    rampTo: 10


  engines:
    playwright:
      launchOptions:
        headless: true
    
  processor: "./stresstest/app.js"

scenarios:
  - engine: playwright
    testFunction: "sendMessageToChat"